{"success":true,"payload":{"value":{"id":"53f065a10635","versionId":"dc61e7019d70","creatorId":"a6d788faa5e5","homeCollectionId":"23738d481ce8","title":"Announcing Dart 3","detectedLanguage":"en","latestVersion":"dc61e7019d70","latestPublishedVersion":"dc61e7019d70","hasUnpublishedEdits":false,"latestRev":508,"createdAt":1681988624445,"updatedAt":1684173038022,"acceptedAt":0,"firstPublishedAt":1683725719657,"latestPublishedAt":1683748404414,"vote":false,"experimentalCss":"","displayAuthor":"","content":{"subtitle":"100% sound null safety. Records, patterns, and class modifiers. \nAnd a peek into the future.","bodyModel":{"paragraphs":[{"name":"feb1","type":3,"text":"Announcing Dart 3","markups":[]},{"name":"ea3f","type":13,"text":"100% sound null safety. Records, patterns, and class modifiers. And a peek into the future.","markups":[]},{"name":"c281","type":1,"text":"Hello from Google I/O 2023. Today, live from Mountain View, we’re announcing Dart 3 — the largest Dart release to date! Dart 3 contains three major advancements. First, we’ve completed the journey to 100% sound null safety. Second, we’ve added major new language features for records, patterns, and class modifiers. Third, we’re giving a preview of the future, where we broaden our platform support with native code for the web via Wasm compilation. Let’s get into the details.","markups":[]},{"name":"dabe","type":4,"text":"","markups":[],"layout":1,"metadata":{"id":"1*2XwxNKHrKb3SGaWEyqg2nA.png","originalWidth":5528,"originalHeight":1754,"isFeatured":true}},{"name":"5b2a","type":3,"text":"100% sound null safety","markups":[]},{"name":"19ff","type":1,"text":"Over the last four years, we’ve evolved Dart into a fast, portable, and modern language. Now with Dart 3, it is a 100% sound null safe language! As we’ve discussed before, we don’t believe any other programming language has ever added sound null safety to an existing language. So, it’s been quite a journey.","markups":[{"type":3,"start":154,"end":170,"href":"https://medium.com/dartlang/the-road-to-dart-3-afdd580fbefa","title":"","rel":"","anchorType":0}]},{"name":"6fd5","type":4,"text":"","markups":[],"layout":1,"metadata":{"id":"1*KPbxBAjFYPCSk2OqwjKs7A.png","originalWidth":960,"originalHeight":384}},{"name":"76a2","type":1,"text":"With 100% null safety in Dart, we have a sound type system. You can trust that if a type says a value isn’t null, then it never can be null. This avoids certain classes of coding errors, like null pointer exceptions. It also allows our compilers and runtimes to optimize code in ways it couldn’t without null safety. This design choice involved a tradeoff. Though migrations became a bit harder, we believe we made the right choice for Dart.","markups":[{"type":10,"start":108,"end":112},{"type":10,"start":135,"end":139},{"type":2,"start":41,"end":46}]},{"name":"c9ba","type":13,"text":"Migrating to Dart 3","markups":[]},{"name":"98b4","type":1,"text":"A critical part in achieving sound null safety has been the unwavering support from the Dart community: 99% of the top 1000 packages on pub.dev support null safety!","markups":[]},{"name":"af44","type":1,"text":"Given this, we expect the vast majority of packages and apps that have been migrated to null safety to work with Dart 3. In just a few cases, a smaller amount of related cleanup in Dart 3 might impact some code. Some legacy core library APIs have been removed (#34233, #49529) and some tools have been adjusted (#50707). Should you experience any issues migrating to using the Dart 3 SDK, please consult the Dart 3 migration guide. Other than that, we hope you’ll enjoy the new rationalized core libraries and tools.","markups":[{"type":3,"start":261,"end":267,"href":"https://github.com/dart-lang/sdk/issues/34233","title":"","rel":"","anchorType":0},{"type":3,"start":269,"end":275,"href":"https://github.com/dart-lang/sdk/issues/49529","title":"","rel":"","anchorType":0},{"type":3,"start":312,"end":318,"href":"https://github.com/dart-lang/sdk/issues/50707","title":"","rel":"","anchorType":0},{"type":3,"start":408,"end":430,"href":"https://dart.dev/resources/dart-3-migration","title":"","rel":"","anchorType":0}]},{"name":"55c5","type":3,"text":"Major language features — Record, patterns, and class modifiers","markups":[]},{"name":"30fd","type":1,"text":"Dart 3 isn’t just about changing the existing language. It’s also about adding significant new features and capabilities! These include records, patterns, and class modifiers.","markups":[]},{"name":"f720","type":13,"text":"Building up structured data with records","markups":[]},{"name":"b3df","type":1,"text":"Traditionally, a Dart function could only return a single value. As a result, functions that needed to return multiple values had to either package these into other data types such as maps or lists or to define new classes that could hold the values. Using untyped data structures weakened type safety. Having to define new classes just to carry data adds friction during the coding process. You made this pretty clear to us: the language request for multiple return values is our fourth highest rated issue.","markups":[{"type":3,"start":481,"end":501,"href":"https://github.com/dart-lang/language/issues?q=is%3Aissue+sort%3Areactions-%2B1-desc+","title":"","rel":"","anchorType":0}]},{"name":"57ba","type":1,"text":"With records, you can build up structured data with a nice and crisp syntax. Consider this function. It reads out the name and age of a JSON blob and returns them both in a record:","markups":[]},{"name":"72b1","type":8,"text":"(String, int) userInfo(Map<String, dynamic> json) {\n  return (json['name'] as String, json['height'] as int);\n}","markups":[],"codeBlockMetadata":{"mode":1,"lang":"dart"}},{"name":"37eb","type":1,"text":"This should look familiar to all Dart developers. A record looks like a list literal such as [‘Michael’, ‘Product Manager’] but uses parentheses instead of brackets. In Dart, records are a general feature. They can be used for more than function return values. You also store them in variables, put them into a list, use them as keys in a map, or create records containing other records. You can add both unnamed fields, like we did in the prior example, and named fields like (42, description: ‘Meaning of life’).","markups":[{"type":10,"start":93,"end":123},{"type":10,"start":477,"end":513}]},{"name":"7379","type":1,"text":"Records are value types and don’t have an identity. This enables our compilers to completely erase the record object in some cases. Records also come with an automatically defined == operator and hashCode functions. The records documentation has more details.","markups":[{"type":10,"start":180,"end":182},{"type":10,"start":196,"end":204},{"type":3,"start":220,"end":241,"href":"https://dart.dev/language/records","title":"","rel":"","anchorType":0}]},{"name":"9b90","type":13,"text":"Working with structured data with patterns and pattern matching","markups":[]},{"name":"927c","type":1,"text":"Records simplify how you build up structured data. This does not replace using classes to build up more formal type hierarchies. It just offers another option. In either case, you might want to break that structured data into its individual elements to work with them. This is where pattern matching comes into play.","markups":[]},{"name":"16c7","type":1,"text":"Consider a basic form of a pattern. The following record pattern destructures a record into two new variables name and height. These variables can then be used like any other variable, such as in a call to print:","markups":[{"type":10,"start":110,"end":114},{"type":10,"start":119,"end":125},{"type":10,"start":206,"end":211}]},{"name":"1cd5","type":8,"text":"var (String name, int height) = userInfo({'name': 'Michael', 'height': 180});\nprint('User $name is $height cm tall.');","markups":[],"codeBlockMetadata":{"mode":1,"lang":"dart"}},{"name":"6155","type":1,"text":"Similar patterns exist for lists and maps. For all of these, you can skip individual elements with the underscore pattern:","markups":[]},{"name":"68f0","type":8,"text":"var (String name, _) = userInfo(…);","markups":[],"codeBlockMetadata":{"mode":2,"lang":"dart"}},{"name":"2524","type":1,"text":"Patterns shine when used in a switch statement. Dart has had limited support for switch since the beginning. In Dart 3 we’ve broadened the power and expressiveness of the switch statement. We now support pattern matching in these cases. We’ve removed the need for adding break at the end of each case. We also support logical operators to combine cases. The following example shows a nice and crisp switch statement that parses a character code:","markups":[{"type":10,"start":171,"end":177},{"type":10,"start":271,"end":276},{"type":10,"start":399,"end":405}]},{"name":"441c","type":8,"text":"switch (charCode) {\n  case slash when nextCharCode == slash:\n    skipComment();\n\n  case slash || star || plus || minus:\n    operator(charCode);\n\n  case >= digit0 && <= digit9:\n    number();\n\n  default:\n    invalid();\n}","markups":[],"codeBlockMetadata":{"mode":2,"lang":"dart"}},{"name":"b851","type":1,"text":"The switch statement provides a great help when you need one or more statements for each case. In some cases, all you want to do is to calculate a value. For that use case, we provide a very succinct switch expression. This resembles the switch statement, but uses different syntax that’s fine tuned for expressions. The following sample function returns the value of a switch expression to calculate a description of today’s weekday:","markups":[{"type":10,"start":89,"end":93},{"type":2,"start":207,"end":217},{"type":2,"start":245,"end":254}]},{"name":"3631","type":8,"text":"String describeDate(DateTime dt) =>\n  switch (dt.weekday) {\n      1 => 'Feeling the Monday blues?',\n      6 || 7 => 'Enjoy the weekend!',\n      _ => 'Hang in there.'\n  };","markups":[],"codeBlockMetadata":{"mode":1,"lang":"dart"}},{"name":"f7a9","type":1,"text":"A powerful feature of patterns is the ability to check for “exhaustiveness”, This feature ensures that the switch handles all the possible cases. In the previous example, we’re handling all possible values of weekday, which is an int. We exhaust all possible values through the combination of match statements for the specific values 1, 6 or 7, and then using a default case _ for the remaining cases. To enable this check for user-defined data hierarchies, such as a class hierarchy, use the new sealed modifier on the top of the class hierarchy as in the following example:","markups":[{"type":10,"start":230,"end":233},{"type":10,"start":334,"end":335},{"type":10,"start":337,"end":339},{"type":10,"start":342,"end":343},{"type":10,"start":375,"end":376},{"type":10,"start":497,"end":503}]},{"name":"f5ac","type":8,"text":"sealed class Animal { … }\nclass Cow extends Animal { … }\nclass Sheep extends Animal { … }\nclass Pig extends Animal { … }\n\nString whatDoesItSay(Animal a) =>\n    switch (a) { Cow c => '$c says moo', Sheep s => '$s says baa' };","markups":[],"codeBlockMetadata":{"mode":1,"lang":"dart"}},{"name":"ed27","type":1,"text":"This returns the following error, alerting us that we missed handling the last possible subtype, Pig:","markups":[]},{"name":"0061","type":8,"text":"line 6 • The type 'Animal' is not exhaustively matched by the switch cases\nsince it doesn't match 'Pig()'.","markups":[],"codeBlockMetadata":{"mode":0,"lang":""}},{"name":"a9f3","type":1,"text":"Finally, if statements can use patterns too. In the next example, we’re using if-case matching against a map-pattern to destructure the JSON map. Inside that, we’re matching against constant values (strings like 'name' and 'Michael') and a type test pattern int h to read out a JSON value. If the pattern matches fail, Dart executes the else statement.","markups":[{"type":10,"start":9,"end":11},{"type":10,"start":212,"end":218},{"type":10,"start":223,"end":232},{"type":10,"start":258,"end":263},{"type":10,"start":337,"end":341},{"type":2,"start":78,"end":85}]},{"name":"bac9","type":8,"text":"final json = {'name': 'Michael', 'height': 180};\n\n// Find Michael's height.\nif (json case {'name': 'Michael', 'height': int h}) {\n  print('Michael is $h cm tall.'); \n} else { \n  print('Error: json contains no height info for Michael!');\n}","markups":[],"codeBlockMetadata":{"mode":1,"lang":"dart"}},{"name":"f5f3","type":1,"text":"This just touches on all the things you can do with patterns. We believe they will become pervasive across all Dart code. To learn more, check out the patterns documentation and patterns codelab.","markups":[{"type":3,"start":151,"end":173,"href":"http://dart.dev/language/patterns","title":"","rel":"","anchorType":0},{"type":3,"start":178,"end":194,"href":"https://codelabs.developers.google.com/codelabs/dart-patterns-records","title":"","rel":"","anchorType":0}]},{"name":"02d8","type":13,"text":"Fine grained access controls for classes with class modifiers","markups":[]},{"name":"6c06","type":1,"text":"A third Dart 3 language feature is class modifiers. Unlike records & patterns that we expect every Dart developer to use, this is more of a power-user feature. It addresses the needs of Dart developers crafting large API surfaces or building enterprise-class apps.","markups":[]},{"name":"94d7","type":1,"text":"Class modifiers enable API authors to support only a specific set of capabilities. The defaults remain unchanged though. We want Dart to remain simple and approachable. So, like before, regular classes can be constructed, extended and implemented, as shown in the following examples:","markups":[{"type":2,"start":209,"end":220},{"type":2,"start":222,"end":230},{"type":2,"start":235,"end":246}]},{"name":"8d90","type":8,"text":"class Vehicle {\n  String make; String model;\n  void moveForward(int meters) { … }\n}\n\n// Construct.\nvar myCar = Vehicle(make: 'Ford', model: 'T',);\n\n// Extend.\nclass Car extends Vehicle {\n  int passengers;\n}\n\n// Implement.\nclass MockVehicle implements Vehicle {\n  @override void moveForward …\n}","markups":[],"codeBlockMetadata":{"mode":1,"lang":"dart"}},{"name":"6a1f","type":1,"text":"Class modifiers support adding restrictions to this. Consider some sample uses cases:","markups":[]},{"name":"cca2","type":9,"text":"With an interface class, you can define a contract for others to implement. An interface class cannot be extended.","markups":[{"type":10,"start":8,"end":23}]},{"name":"be08","type":9,"text":"With a base class, you can ensure that all of the subtypes of your class inherit from it, instead of implementing its interface. This ensures that private methods are available on all instances.","markups":[{"type":10,"start":7,"end":17}]},{"name":"6f92","type":9,"text":"With a final class, you can close the type hierarchy preventing any subclasses outside of your own library. As a sample benefit, this allows the API owner to add new members without risking breaking changes to the consumers of the API.","markups":[{"type":10,"start":7,"end":18}]},{"name":"d6af","type":1,"text":"For details, see the new class modifiers documentation.","markups":[{"type":3,"start":25,"end":54,"href":"https://dart.dev/language/class-modifiers","title":"","rel":"","anchorType":0}]},{"name":"4360","type":3,"text":"A view towards the future","markups":[]},{"name":"4b08","type":1,"text":"Dart 3 is not just a significant step forward in terms of new features you can use today. We’re also giving you a preview of what’s next.","markups":[]},{"name":"ff7d","type":13,"text":"Dart language","markups":[]},{"name":"d230","type":1,"text":"Records, patterns, and class modifiers are very large new features, so it’s possible that there are parts of their design that could be improved. We’ll continue to monitor your feedback, and see if updates are needed in minor releases following Dart 3.","markups":[{"type":3,"start":172,"end":185,"href":"https://github.com/dart-lang/language/issues","title":"","rel":"","anchorType":0}]},{"name":"cb77","type":1,"text":"We’re also looking at some smaller, more incremental features that are entirely non-breaking and focused on increasing developer productivity without migration cost. Two examples we’re exploring are inline classes for wrapping existing types with zero-cost “wrappers”, and primary constructors; a feature that introduces a much more concise syntax for defining classes with a few fields and a primary constructor.","markups":[{"type":3,"start":199,"end":213,"href":"https://github.com/dart-lang/language/issues/2727","title":"","rel":"","anchorType":0},{"type":3,"start":273,"end":293,"href":"https://github.com/dart-lang/language/issues/2364","title":"","rel":"","anchorType":0}]},{"name":"1b0d","type":1,"text":"We’ve previously discussed macros (also referred to as meta-programming). We’re in particular focused on this for enabling better deserialization of JSON (and similar), and for enabling data classes. Given the size and inherent risk in metaprogramming, we’re taking a very thorough approach, and we thus have no concrete timeline to share, even for finalizing design decisions.","markups":[{"type":3,"start":55,"end":71,"href":"https://github.com/dart-lang/language/blob/main/working/macros/feature-specification.md","title":"","rel":"","anchorType":0}]},{"name":"8a3b","type":13,"text":"Native interop","markups":[]},{"name":"4bf4","type":1,"text":"Apps on mobile and desktop typically rely on lots of APIs provided by the native platform, whether it’s notifications, payments, or getting the phone’s location. Traditionally in Flutter these are accessed by building plugins, which require writing both Dart code for the API and a bunch of platform-specific code to provide the implementation.","markups":[]},{"name":"d495","type":1,"text":"We already support interop with code that compiles to C libraries with dart:ffi. We’re currently working on expanding this to support Java and Kotlin interop on Android, and Objective C and Swift interop on iOS/macOS. For an introduction to the Android interop, checkout the new Google I/O 23 Android interoperability video.","markups":[{"type":10,"start":71,"end":79},{"type":3,"start":71,"end":79,"href":"https://dart.dev/guides/libraries/c-interop","title":"","rel":"","anchorType":0},{"type":3,"start":134,"end":157,"href":"https://dart.dev/guides/libraries/java-interop","title":"","rel":"","anchorType":0},{"type":3,"start":174,"end":203,"href":"https://dart.dev/guides/libraries/objective-c-interop","title":"","rel":"","anchorType":0},{"type":3,"start":293,"end":323,"href":"https://io.google/2023/program/2f02692d-9a41-49c0-8786-1a22b7155628/","title":"","rel":"","anchorType":0}]},{"name":"96d6","type":13,"text":"Compilation to WebAssembly — targeting the web with native code","markups":[]},{"name":"a6b0","type":1,"text":"WebAssembly (abbreviated Wasm) has been growing in maturity as a platform-neutral binary instruction format across all modern browsers. The Flutter framework has used Wasm for a while. It’s how we deliver the SKIA graphics rendering engine, written in C++, to the browser via a Wasm compiled module. We’ve long had an interest in using Wasm to deploy Dart code too, but we’ve been blocked. Dart, like many other object oriented languages, uses garbage collection. Over the past year, we’ve collaborated with several teams across the Wasm ecosystem to add a new WasmGC feature to the WebAssembly standard. This is now near-stable in the Chromium and Firefox browsers.","markups":[{"type":3,"start":0,"end":11,"href":"https://webassembly.org/","title":"","rel":"","anchorType":0},{"type":3,"start":115,"end":134,"href":"https://caniuse.com/wasm","title":"","rel":"","anchorType":0}]},{"name":"9c0f","type":1,"text":"Our work on compiling Dart to Wasm modules has two high-level goals for web apps:","markups":[]},{"name":"3074","type":9,"text":"Load time: we hope that we can deliver deployment payloads with Wasm that the browser can load faster, thus improving the time it takes to get to the point where the user can interact with the web app.","markups":[{"type":1,"start":0,"end":10}]},{"name":"8e69","type":9,"text":"Performance: Web apps powered by JavaScript require just-in-time compilation to achieve good performance. Wasm modules are more low-level and closer to machine code, so we think they can deliver higher performance with less jank and more consistent frame rates.","markups":[{"type":1,"start":0,"end":13}]},{"name":"f49f","type":9,"text":"Semantic consistency: Dart takes pride in being highly consistent between our supported platforms. However, on the web, there are a few exceptions to this. For example, Dart web currently differs in how numbers are represented. With Wasm modules, we’d be able to treat the web like a “native” platform with semantics similar to other native targets.","markups":[{"type":3,"start":202,"end":226,"href":"https://dart.dev/guides/language/numbers","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":20}]},{"name":"adb6","type":1,"text":"We’re excited to announce the first preview of Dart to Wasm compilation today! Our initial focus is on Flutter web support. It’s still early, and we have lots of work to complete, but we invite you to experiment and see if this has you as excited as we are.","markups":[{"type":3,"start":187,"end":212,"href":"https://flutter.dev/wasm","title":"","rel":"","anchorType":0}]},{"name":"300e","type":3,"text":"Closing","markups":[]},{"name":"de15","type":1,"text":"Thanks for reading until the end. We hope this post has made you excited about Dart 3, available today in both the stand-alone Dart SDK and in the Flutter 3.10 SDK.","markups":[{"type":3,"start":127,"end":135,"href":"https://dart.dev/get-dart","title":"","rel":"noopener","anchorType":0},{"type":3,"start":147,"end":163,"href":"https://medium.com/flutter/whats-new-in-flutter-3-10-b21db2c38c73","title":"","rel":"","anchorType":0}]},{"name":"bcb6","type":1,"text":"We’ve completed a major overhaul of the Dart language with sound null safety, and core library and tools cleanup. There are major new language features that make Dart more expressive and crisp with records and patterns. For large API surfaces, class modifiers enable detailed control. We’re also including a preview of the future with our coming support for WebAssembly.","markups":[]},{"name":"63b6","type":1,"text":"With all of these features, we think Dart 3 illustrates our long-term vision: To build the most productive programming language for building fast apps on any platform. We hope you think so too!","markups":[{"type":2,"start":78,"end":166}]}],"sections":[{"name":"b25e","startIndex":0},{"name":"b050","startIndex":4}]},"postDisplay":{"coverless":true}},"virtuals":{"statusForCollection":"APPROVED","allowNotes":true,"previewImage":{"imageId":"1*2XwxNKHrKb3SGaWEyqg2nA.png","filter":"","backgroundSize":"","originalWidth":5528,"originalHeight":1754,"strategy":"resample","height":0,"width":0},"wordCount":2318,"imageCount":2,"readingTime":9.130503144654087,"subtitle":"100% sound null safety. Records, patterns, and class modifiers. \nAnd a peek into the future.","userPostRelation":{"userId":"8b6a7f6f197d","postId":"53f065a10635","readAt":0,"readLaterAddedAt":0,"votedAt":0,"collaboratorAddedAt":0,"notesAddedAt":0,"subscribedAt":0,"lastReadSectionName":"","lastReadVersionId":"","lastReadAt":0,"lastReadParagraphName":"","lastReadPercentage":0,"viewedAt":0,"presentedCountInResponseManagement":0,"clapCount":0,"seriesUpdateNotifsOptedInAt":0,"queuedAt":0,"seriesFirstViewedAt":0,"presentedCountInStream":8,"seriesLastViewedAt":0,"audioProgressSec":0},"publishedInCount":1,"usersBySocialRecommends":[],"noIndex":false,"recommends":412,"isBookmarked":false,"tags":[{"slug":"dart","name":"Dart","postCount":13858,"metadata":{"postCount":13858,"coverImage":{"id":"1*rQugDrmwFFsEDL_CqSBJNw.png","originalWidth":1536,"originalHeight":1024,"isFeatured":true}},"type":"Tag"},{"slug":"dartlang","name":"Dartlang","postCount":921,"metadata":{"postCount":921,"coverImage":{"id":"1*HNqQFQ2hdhAgjew1pIMqXA.png","originalWidth":2752,"originalHeight":1536,"isFeatured":true}},"type":"Tag"},{"slug":"releases","name":"Releases","postCount":2657,"metadata":{"postCount":2657,"coverImage":{"id":"1*iArl-N8doV29po53Pcyxmw.jpeg","originalWidth":2160,"originalHeight":1440,"isFeatured":true}},"type":"Tag"}],"socialRecommendsCount":0,"responsesCreatedCount":10,"links":{"entries":[{"url":"https://dart.dev/guides/libraries/java-interop","alts":[],"httpStatus":200},{"url":"https://webassembly.org/","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/language/issues/2727","alts":[],"httpStatus":200},{"url":"https://dart.dev/resources/dart-3-migration","alts":[],"httpStatus":200},{"url":"https://dart.dev/guides/language/numbers","alts":[],"httpStatus":200},{"url":"https://dart.dev/guides/libraries/objective-c-interop","alts":[],"httpStatus":200},{"url":"https://dart.dev/language/records","alts":[],"httpStatus":200},{"url":"https://flutter.dev/wasm","alts":[],"httpStatus":200},{"url":"https://io.google/2023/program/2f02692d-9a41-49c0-8786-1a22b7155628/","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/language/issues/2364","alts":[],"httpStatus":200},{"url":"https://medium.com/dartlang/the-road-to-dart-3-afdd580fbefa","alts":[{"type":3,"url":"medium://p/afdd580fbefa"},{"type":2,"url":"medium://p/afdd580fbefa"}],"httpStatus":200},{"url":"https://dart.dev/guides/libraries/c-interop","alts":[],"httpStatus":200},{"url":"https://dart.dev/language/class-modifiers","alts":[],"httpStatus":200},{"url":"https://dart.dev/get-dart","alts":[],"httpStatus":200},{"url":"http://dart.dev/language/patterns","alts":[],"httpStatus":200},{"url":"https://medium.com/flutter/whats-new-in-flutter-3-10-b21db2c38c73","alts":[{"type":3,"url":"medium://p/b21db2c38c73"},{"type":2,"url":"medium://p/b21db2c38c73"}],"httpStatus":200},{"url":"https://github.com/dart-lang/language/blob/main/working/macros/feature-specification.md","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/language/issues","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/language/issues?q=is%3Aissue+sort%3Areactions-%2B1-desc+","alts":[],"httpStatus":200},{"url":"https://caniuse.com/wasm","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/sdk/issues/34233","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/sdk/issues/50707","alts":[],"httpStatus":200},{"url":"https://github.com/dart-lang/sdk/issues/49529","alts":[],"httpStatus":200},{"url":"https://codelabs.developers.google.com/codelabs/dart-patterns-records","alts":[],"httpStatus":200}],"version":"0.3","generatedAt":1683748405808},"isLockedPreviewOnly":false,"metaDescription":"","totalClapCount":3509,"sectionCount":2,"readingList":0,"topics":[{"topicId":"decb52b64abf","slug":"programming","createdAt":1493934116328,"deletedAt":0,"image":{"id":"1*iPa136b1cGEO7lvoXg6uHQ@2x.jpeg","originalWidth":6016,"originalHeight":4016},"name":"Programming","description":"The good, the bad, the buggy.","relatedTopics":[],"visibility":1,"relatedTags":[],"relatedTopicIds":[],"seoTitle":"Programming News and Articles — Medium","type":"Topic"}]},"coverless":true,"slug":"announcing-dart-3","translationSourcePostId":"","translationSourceCreatorId":"","isApprovedTranslation":false,"inResponseToPostId":"","inResponseToRemovedAt":0,"isTitleSynthesized":false,"allowResponses":true,"importedUrl":"","importedPublishedAt":0,"visibility":0,"uniqueSlug":"announcing-dart-3-53f065a10635","previewContent":{"bodyModel":{"paragraphs":[{"name":"previewImage","type":4,"text":"","layout":10,"metadata":{"id":"1*2XwxNKHrKb3SGaWEyqg2nA.png","originalWidth":5528,"originalHeight":1754,"isFeatured":true}},{"name":"feb1","type":3,"text":"Announcing Dart 3","markups":[],"alignment":1},{"name":"ea3f","type":13,"text":"100% sound null safety. Records, patterns, and class modifiers. And a peek into the…","markups":[],"alignment":1}],"sections":[{"startIndex":0}]},"isFullContent":false,"subtitle":"100% sound null safety. Records, patterns, and class modifiers. \nAnd a peek into the future."},"license":1,"inResponseToMediaResourceId":"","canonicalUrl":"https://blog.dart.dev/announcing-dart-3-53f065a10635","approvedHomeCollectionId":"23738d481ce8","isNewsletter":false,"newsletterId":"7ce082d80f67","webCanonicalUrl":"https://blog.dart.dev/announcing-dart-3-53f065a10635","mediumUrl":"https://blog.dart.dev/announcing-dart-3-53f065a10635","migrationId":"","notifyFollowers":true,"notifyTwitter":false,"notifyFacebook":false,"responseHiddenOnParentPostAt":0,"isSeries":false,"isSubscriptionLocked":false,"seriesLastAppendedAt":0,"audioVersionDurationSec":0,"sequenceId":"","isEligibleForRevenue":false,"isBlockedFromHightower":false,"deletedAt":0,"lockedPostSource":0,"hightowerMinimumGuaranteeStartsAt":0,"hightowerMinimumGuaranteeEndsAt":0,"featureLockRequestAcceptedAt":0,"mongerRequestType":1,"layerCake":0,"socialTitle":"","socialDek":"","editorialPreviewTitle":"","editorialPreviewDek":"","curationEligibleAt":0,"isProxyPost":false,"proxyPostFaviconUrl":"","proxyPostProviderName":"","proxyPostType":0,"isSuspended":false,"isLimitedState":false,"seoTitle":"","previewContent2":{"bodyModel":{"paragraphs":[{"name":"feb1","type":3,"text":"Announcing Dart 3","markups":[]},{"name":"ea3f","type":13,"text":"100% sound null safety. Records, patterns, and class modifiers. And a peek into the future.","markups":[]},{"name":"c281","type":1,"text":"Hello from Google I/O 2023. Today, live from Mountain View, we’re announcing Dart 3 — the largest Dart release to date! Dart 3 contains three major advancements. First, we’ve completed the journey to 100% sound null safety. Second, we’ve added major new language features for records, patterns, and class modifiers…","markups":[]}],"sections":[{"name":"b25e","startIndex":0}]},"isFullContent":false,"subtitle":"100% sound null safety. Records, patterns, and class modifiers. \nAnd a peek into the future."},"cardType":0,"isDistributionAlertDismissed":false,"isShortform":false,"shortformType":0,"responsesLocked":false,"isLockedResponse":false,"isPublishToEmail":true,"responseDistribution":0,"isMarkedPaywallOnly":false,"type":"Post"},"mentionedUsers":[],"collaborators":[],"hideMeter":false,"shareKey":"ee7b03a2fd6e19a384cb79a49b6d181a","collectionUserRelations":[{"collectionId":"23738d481ce8","userId":"8b6a7f6f197d","role":"ADMIN"},{"collectionId":"4da7dfd21a33","userId":"8b6a7f6f197d","role":"WRITER"},{"collectionId":"24d8f4fa8912","userId":"8b6a7f6f197d","role":"WRITER"}],"mode":"canEdit","references":{"User":{"a6d788faa5e5":{"userId":"a6d788faa5e5","name":"Michael Thomsen","username":"mit.mit","createdAt":1481367237471,"imageId":"0*Y_CFLc1qadgr3tPK.","backgroundImageId":"","bio":"Product Manager working on Dart and Flutter. Helping developers is my passion!","twitterScreenName":"","socialStats":{"userId":"a6d788faa5e5","usersFollowedCount":1,"usersFollowedByCount":9653,"type":"SocialStats"},"social":{"userId":"8b6a7f6f197d","targetUserId":"a6d788faa5e5","isFollowing":true,"isTwitterFollowing":false,"isFacebookFollowing":false,"isMediumFollowing":true,"type":"Social"},"allowNotes":1,"mediumMemberAt":1752847030513,"isWriterProgramEnrolled":true,"isSuspended":false,"isMembershipTrialEligible":true,"facebookDisplayName":"","optInToIceland":true,"hasCompletedProfile":false,"userDismissableFlags":[1,2,5,8,12,17,18,21,30,32,33,53,58,59,61],"hasSeenIcelandOnboarding":true,"postSubscribeMembershipUpsellShownAt":0,"languageCode":"da","type":"User"}},"Collection":{"23738d481ce8":{"id":"23738d481ce8","name":"Dart","slug":"dartlang","tags":["MOBILE APP DEVELOPMENT","WEB DEVELOPMENT","DART","PROGRAMMING LANGUAGES","SOFTWARE DEVELOPMENT"],"creatorId":"a6d788faa5e5","description":"Dart is an approachable, portable, and productive language for high-quality apps on any platform. Learn more at https://dart.dev.","shortDescription":"Dart is an approachable, portable, and productive language…","image":{"imageId":"1*uWy1Ajpd0oTUQBO9WBHoQg@2x.png","filter":"","backgroundSize":"","originalWidth":1001,"originalHeight":1001,"strategy":"resample","height":0,"width":0},"metadata":{"followerCount":14031,"activeAt":1762974121956},"virtuals":{"permissions":{"canPublish":true,"canPublishAll":true,"canRepublish":true,"canRemove":true,"canManageAll":true,"canSubmit":true,"canEditPosts":true,"canAddWriters":true,"canViewStats":true,"canSendNewsletter":true,"canViewLockedPosts":true,"canViewCloaked":true,"canEditOwnPosts":true,"canBeAssignedAuthor":true,"canEnrollInHightower":false,"canLockPostsForMediumMembers":false,"canLockOwnPostsForMediumMembers":false,"canViewNewsletterV2Stats":true,"canCreateNewsletterV3":true},"isSubscribed":true,"isEnrolledInHightower":false,"isEligibleForHightower":false,"isSubscribedToCollectionEmails":false,"isMuted":false,"canToggleEmail":false,"isWriter":false},"logo":{"imageId":"1*NRb7RFVWJQFzY47j3v4U7Q.png","filter":"","backgroundSize":"","originalWidth":400,"originalHeight":154,"strategy":"resample","height":0,"width":0},"twitterUsername":"dart_lang","publicEmail":"medium@dartlang.org","domain":"blog.dart.dev","sections":[{"type":2,"collectionHeaderMetadata":{"title":"Dart","description":"An approachable, portable, and productive language for high-quality apps on any platform","backgroundImage":{},"logoImage":{"id":"1*knHF_qpxdtS8h0Z8EeqowA@2x.png","originalWidth":1080,"originalHeight":1080,"alt":"Dart"},"alignment":2,"layout":5}},{"type":1,"postListMetadata":{"source":1,"layout":4,"number":7,"postIds":[]}},{"type":1,"postListMetadata":{"source":1,"layout":5,"number":15,"postIds":[]}}],"tintColor":"#FF042B59","lightText":true,"favicon":{"imageId":"","filter":"","backgroundSize":"","originalWidth":0,"originalHeight":0,"strategy":"resample","height":0,"width":0},"colorPalette":{"defaultBackgroundSpectrum":{"colorPoints":[{"color":"#FF6588BA","point":0},{"color":"#FF607EAB","point":0.1},{"color":"#FF59759C","point":0.2},{"color":"#FF536B8E","point":0.3},{"color":"#FF4C617F","point":0.4},{"color":"#FF445670","point":0.5},{"color":"#FF3D4B61","point":0.6},{"color":"#FF344052","point":0.7},{"color":"#FF2B3442","point":0.8},{"color":"#FF212832","point":0.9},{"color":"#FF161A22","point":1}],"backgroundColor":"#FFFFFFFF"},"tintBackgroundSpectrum":{"colorPoints":[{"color":"#FF042B59","point":0},{"color":"#FF294871","point":0.1},{"color":"#FF456087","point":0.2},{"color":"#FF5F779B","point":0.3},{"color":"#FF788DAD","point":0.4},{"color":"#FF8FA2BF","point":0.5},{"color":"#FFA5B6CF","point":0.6},{"color":"#FFBBC9DF","point":0.7},{"color":"#FFD1DCEE","point":0.8},{"color":"#FFE6EEFC","point":0.9},{"color":"#FFFBFFFF","point":1}],"backgroundColor":"#FF042B59"},"highlightSpectrum":{"colorPoints":[{"color":"#FFECF3FF","point":0},{"color":"#FFE9F2FF","point":0.1},{"color":"#FFE5F0FF","point":0.2},{"color":"#FFE2EFFF","point":0.3},{"color":"#FFDEEDFF","point":0.4},{"color":"#FFDBEBFF","point":0.5},{"color":"#FFD7EAFF","point":0.6},{"color":"#FFD3E8FF","point":0.7},{"color":"#FFCFE6FF","point":0.8},{"color":"#FFCBE5FF","point":0.9},{"color":"#FFC8E3FF","point":1}],"backgroundColor":"#FFFFFFFF"},"darkBackgroundSpectrum":{"colorPoints":[{"color":"#FF7DA0D3","point":0},{"color":"#FF89A9D8","point":0.1},{"color":"#FF94B1DC","point":0.2},{"color":"#FFA0B9E0","point":0.3},{"color":"#FFABC1E3","point":0.4},{"color":"#FFB6C9E7","point":0.5},{"color":"#FFC0D1EB","point":0.6},{"color":"#FFCBD8EF","point":0.7},{"color":"#FFD5E0F2","point":0.8},{"color":"#FFE0E7F6","point":0.9},{"color":"#FFEAEFFA","point":1}],"backgroundColor":"#FF000000"}},"navItems":[{"type":1,"title":"Announcements","tagSlug":"announcements","url":"https://blog.dart.dev/tagged/announcements","source":"tagSlug"},{"type":5,"title":"Archive","url":"https://blog.dart.dev/archive"},{"type":3,"title":"dart.dev","url":"https://dart.dev"}],"colorBehavior":2,"collectionFeatures":[25],"ampLogo":{"imageId":"","filter":"","backgroundSize":"","originalWidth":0,"originalHeight":0,"strategy":"resample","height":0,"width":0},"header":{"title":"Dart","description":"An approachable, portable, and productive language for high-quality apps on any platform","backgroundImage":{},"logoImage":{"id":"1*knHF_qpxdtS8h0Z8EeqowA@2x.png","originalWidth":1080,"originalHeight":1080,"alt":"Dart"},"alignment":2,"layout":5},"subscriberCount":14031,"tagline":"Dart is a client-optimized language for fast apps on any platform.","isOptedIntoAurora":false,"isCurationAllowedByDefault":false,"polarisCoverImage":{"imageId":"","filter":"","backgroundSize":"","originalWidth":0,"originalHeight":0,"strategy":"resample","height":0,"width":0},"ptsQualifiedAt":1616092887098,"type":"Collection"}},"Social":{"a6d788faa5e5":{"userId":"8b6a7f6f197d","targetUserId":"a6d788faa5e5","isFollowing":true,"isTwitterFollowing":false,"isFacebookFollowing":false,"isMediumFollowing":true,"type":"Social"}},"SocialStats":{"a6d788faa5e5":{"userId":"a6d788faa5e5","usersFollowedCount":1,"usersFollowedByCount":9653,"type":"SocialStats"}}}},"v":3,"b":"20260130-1005-root"}