{"success":true,"payload":{"value":{"id":"a9c5ff22a534","versionId":"e836407fec53","creatorId":"be6cdabfe936","homeCollectionId":"23738d481ce8","title":"StageXL 1.0","detectedLanguage":"en","latestVersion":"e836407fec53","latestPublishedVersion":"e836407fec53","hasUnpublishedEdits":false,"latestRev":645,"createdAt":1480750662585,"updatedAt":1528477885140,"acceptedAt":0,"firstPublishedAt":1480797588313,"latestPublishedAt":1480797588313,"vote":false,"experimentalCss":"","displayAuthor":"","content":{"subtitle":"A fast 2D rendering engine for HTML5 and Dart.","bodyModel":{"paragraphs":[{"name":"0e3e","type":3,"text":"StageXL 1.0","markups":[]},{"name":"286b","type":13,"text":"A fast 2D rendering engine for HTML5 and Dart.","markups":[]},{"name":"6748","type":4,"text":"","markups":[],"layout":1,"metadata":{"id":"1*oPIKFEq7-9ndX53muruOsQ.jpeg","originalWidth":800,"originalHeight":400}},{"name":"95ae","type":1,"text":"After more than 4 years in development and available since the early beta versions of Dart, we are proud to announce the release of StageXL 1.0. StageXL is a fast and universal 2D render engine for games and applications on the web. This article talks about the most important features and applications of this library.","markups":[{"type":3,"start":145,"end":152,"href":"http://www.stagexl.org/","title":"","rel":"","anchorType":0}]},{"name":"ce45","type":3,"text":"Standing on the shoulders of giants: Adobe Flash","markups":[]},{"name":"3fbb","type":1,"text":"Several years ago it became apparent that Adobe Flash will be replaced by the capabilities of HTML5. Video streaming platforms replaced their Flash players with HTML5 players and Google’s AdWords network banned all Flash based display ads recently. The last big resort of Flash applications on the web are games. Even today most games on facebook are built with Flash.","markups":[]},{"name":"7f5e","type":1,"text":"Game developers had no other choice than using Flash for games in the past. The capabilities of the DOM were not suitable for games and even after the introduction of the canvas element you had to deal with performance issues, compatibility issues and last but not least JavaScript (a language born out of hell if you ask certain Flash/ActionScript developers). Things became better with the introduction of libraries like CreateJS or PixiJS which provide a Flash like API and developer experience. Also the raise of languages like TypeScript, Haxe or CoffeeScript reduced the pain.","markups":[{"type":3,"start":423,"end":431,"href":"http://www.createjs.com/","title":"","rel":"","anchorType":0},{"type":3,"start":435,"end":441,"href":"http://www.pixijs.com/","title":"","rel":"","anchorType":0},{"type":3,"start":532,"end":542,"href":"https://www.typescriptlang.org/","title":"","rel":"","anchorType":0},{"type":3,"start":544,"end":548,"href":"https://haxe.org/","title":"","rel":"","anchorType":0},{"type":3,"start":552,"end":564,"href":"http://coffeescript.org/","title":"","rel":"","anchorType":0}]},{"name":"a552","type":1,"text":"As a former Flash/ActionScript game developer myself, I experienced all the things mentioned above first-hand. But once i got in touch with the early versions of Dart it was clear that it was a worthy successor to ActionScript. Dart looks and feels very similar to ActionScript and at the same time it is a much more modern language that avoids bloated syntax. But Flash is much more than the language. Flash provides a display tree based render engine, a sound engine, vector graphics, text rendering and much more. This was the foundation for StageXL — this new library should provider the features of Flash in combination with Dart and HTML5. Developers should be able to use Dart and StageXL to write their games in the same way as they did with Flash before. To make it even easier the API of StageXL is mostly identical to the one of Flash.","markups":[]},{"name":"7019","type":1,"text":"Flash developers should be familiar with StageXL code like this:","markups":[]},{"name":"2e0b","type":8,"text":"Sprite createContainer(BitmapData bitmapData) {\n  var bitmap = new Bitmap(bitmapData);\n  var sprite = new Sprite();\n  bitmap.x = -bitmapData.width / 2;\n  bitmap.y = -bitmapData.height / 2;\n  sprite.addChild(bitmap);\n  sprite.alpha = 0.5;\n  return sprite;\n}","markups":[{"type":1,"start":0,"end":6},{"type":1,"start":23,"end":33},{"type":1,"start":67,"end":73},{"type":1,"start":106,"end":112},{"type":1,"start":125,"end":126},{"type":1,"start":141,"end":146},{"type":1,"start":161,"end":162},{"type":1,"start":177,"end":183},{"type":1,"start":198,"end":206},{"type":1,"start":225,"end":230}]},{"name":"1e0b","type":14,"text":"StageXL - ActionScript to Dart comparison\nComing from ActionScript and learning Dart is easy. Both languages are class-based, single inheritance, object-oriented…www.stagexl.org","markups":[{"type":3,"start":0,"end":177,"href":"http://www.stagexl.org/docs/actionscript-dart.html","title":"http://www.stagexl.org/docs/actionscript-dart.html","rel":"","anchorType":0},{"type":1,"start":0,"end":41},{"type":2,"start":42,"end":162}],"mixtapeMetadata":{"mediaResourceId":"b34a9814817b49034655a897902e5281","thumbnailImageId":"","href":"http://www.stagexl.org/docs/actionscript-dart.html"}},{"name":"1bb1","type":3,"text":"StageXL in a nutshell","markups":[]},{"name":"0946","type":1,"text":"The API of StageXL covers a wide range of features. The main purpose of the library is a fast and easy to use render engine, but you need more than that to write a game or application.","markups":[]},{"name":"1ece","type":1,"text":"Graphics: A display tree is built out of nodes that extend the abstract DisplayObject base class. The position of a node on the tree defines if the display object is in front or back of another object. To create branches on the tree, a second abstract base class called DisplayObjectContainer is used. You can build custom display objects by extending one of those two base classes, or you can use one of the built in classes like Sprite, Bitmap, TextField or Shape. All these classes are the same as in Flash and similar concepts are used in other render engines too.","markups":[{"type":3,"start":493,"end":509,"href":"http://help.adobe.com/en_US/as3/dev/WS5b3ccc516d4fbf351e63e3d118a9b90204-7e26.html","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":9}]},{"name":"3e8b","type":1,"text":"Interaction: The EventDispatcher class provides the capabilities to dispatch events and to subscribe listeners to certain events. All display objects extend the EventDispatcher class and therefore they are capable of dispatching events. Those events can be custom events dispatched by your game logic, or events for mouse, touch and keyboard interaction dispatched by the StageXL runtime. Since all display objects live within the display tree, an event is propagated over all nodes from the root node to the target node and back again (capturing, target and bubbling phase of an event).","markups":[{"type":1,"start":0,"end":12}]},{"name":"d559","type":1,"text":"Audio: Every game needs proper sound effects. StageXL provides the infrastructure to load and play audio samples without much hassle. The Sound class represents an audio sample that was loaded into memory. Calling the play method on the Sound class will start playing the audio sample and it will return an instance of the SoundChannel class to get control over the playback. You can play multiple instances of the same Sound concurrently, for example play multiple instances of an explosion sound.","markups":[{"type":1,"start":0,"end":6}]},{"name":"ebdf","type":1,"text":"Resources: StageXL makes it easy to load images, audio files and other resources from the server. Since loading such files is an asynchronous operation, a Future based API is provided. Loading an image is as easy as waiting for the completion of the Future returned by the BitmapData.load method. The same is true for the Future returned by the Sound.load or TextureAtlas.load methods. To make it even more convenient to load many different resources at once, the ResourceManager class can be used. This class loads all specified resources and provides easy access to those resources once the loading process has finished. The ResourceManager can be seen as the replacement for embedded resources in Flash.","markups":[{"type":1,"start":0,"end":10}]},{"name":"adcf","type":1,"text":"Animation: StageXL also contains a framework for animations called Juggler. The Juggler framework was introduced by the Starling render engine well known among Flash developers. The Juggler is used to control so called Animatables based on the time that has passed between two render frames. One of those Animatables is the Tween class, which is used to animate the position, the rotation, the scaling or the translucency of any display object. The Juggler also provides time based Streams to control values in your game logic. More details can be found in the Juggler documentation.","markups":[{"type":3,"start":120,"end":128,"href":"http://gamua.com/starling/","title":"","rel":"","anchorType":0},{"type":3,"start":561,"end":582,"href":"http://www.stagexl.org/docs/wiki-articles.html?article=juggler","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":10}]},{"name":"b2b4","type":3,"text":"StageXL behind the scenes","markups":[]},{"name":"9260","type":1,"text":"The render engine of StageXL is built on top of WebGL for best performance and flexibility. Of course the developer does not need to know anything about WebGL to use StageXL. Still, it is worth noting that display objects are rendered by WebGL shader programs either by using a default shader or a more advanced shader for filter effects like BlurFilter, DropShadowFilter, ColorMatrixFilter and others. In more advanced use cases developers can use custom filters by implementing their own WebGL shader program code.","markups":[]},{"name":"40da","type":1,"text":"To achieve the best rendering performance possible it is essential to use so called texture atlases. All your image assets are combined in one big image that is uploaded to the memory of the GPU. Therefor StageXL supports the most common texture atlas formats out of the box. Use your favorite texture atlas generator (we highly recommend TexturePacker) to generate the texture atlas, the rest is handled by StageXL internally. As a special goodie StageXL supports advanced texture atlas features such as polygon sprite meshes and the polygon packing algorithm.","markups":[{"type":3,"start":339,"end":352,"href":"https://www.codeandweb.com/texturepacker","title":"","rel":"","anchorType":0},{"type":3,"start":505,"end":526,"href":"https://www.codeandweb.com/texturepacker/tutorials/cocos2d-x-performance-optimization","title":"","rel":"","anchorType":0}]},{"name":"35f5","type":1,"text":"The sound engine of StageXL is build on top of the WebAudio API. Similar to WebGL the developer does not to need to know anything about this API. To play audio samples you just need to use the Sound and SoundChannel classes which do all the heavy lifting for you. A common pain with playing audio on different browsers is the missing support for certain audio codecs. You probably encode you audio samples as mp3 files, but it is not guaranteed that mp3 is supported on all platforms. The same is true if you encode your audio samples with any other file format. StageXL solves this problem by automatically loading the correct audio format based on the capabilities of the browser.","markups":[]},{"name":"791b","type":1,"text":"Other 2D render engines for JavaScript often claim to be the fastest and most flexible ones. Of course this claim depends heavily on the benchmark or the use case and is very difficult to verify. During the design and development of StageXL we constantly compared its performance and flexibility to other engines. In the end both quality factors do match or even surpass other engines which claim to be the best. One of the big advantages for StageXL in this regard is the use of the Dart programming language. The language not only allows a very clean API design, but also provides an outstanding compiler to JavaScript that optimizes certain patterns in a way you practically can’t implement by hand in JavaScript. The compiled JavaScript does not need to look pretty, it only needs to run fast. The compiler does function inlining, dead code elimination, constant folding, type inference and other optimizations. The compiler is also aware of how the JavaScript needs to look like to make it run fast in modern JavaScript engines. This is very different to other languages like TypeScript where the code is not compiled to JavaScript but only transpiled to JavaScript. Last but not least, you won’t need to change a single line of code to compile to native ES5 and ES6 JavaScript.","markups":[]},{"name":"4668","type":14,"text":"StageXL BunnyMark\nRender as many bunnies as possible!www.stagexl.org","markups":[{"type":3,"start":0,"end":68,"href":"http://www.stagexl.org/example/benchmark/bunny_mark/?v=2","title":"http://www.stagexl.org/example/benchmark/bunny_mark/?v=2","rel":"","anchorType":0},{"type":1,"start":0,"end":17},{"type":2,"start":18,"end":53}],"mixtapeMetadata":{"mediaResourceId":"07549c4f4c5442930cd55a5b712e9af9","thumbnailImageId":"0*bOA3r5FQTEBmCvBp.","href":"http://www.stagexl.org/example/benchmark/bunny_mark/?v=2"}},{"name":"f75a","type":3,"text":"StageXL to be continued","markups":[]},{"name":"0bd7","type":1,"text":"It took over 4 years to get to version 1.0 of StageXL. The reason for such a long time is that there is always something to improve or to add and you never think that the project is finished. This is also true for version 1.0 and new features will be added on a regular basis in the future. The feedback from the community is very valuable and feature requests are always welcome — bug reports too, to a certain degree ;)","markups":[]},{"name":"e2df","type":1,"text":"Probably the biggest feature we see on the horizon is support for Flutter. You would be able to write mobile games in Dart and StageXL for Android and iOS. The early versions of Flutter look very promising, unfortunately the platform does not yet expose the OpenGL APIs you need to build StageXL on top of it. We will keep an eye on the development and hope that it won’t take too long to see StageXL on mobile devices.","markups":[{"type":3,"start":66,"end":73,"href":"https://flutter.io/","title":"","rel":"","anchorType":0}]},{"name":"aed0","type":14,"text":"Flutter: The best mobile development experience?\nDeveloping for mobile just got a lot more fun with Flutter's live developer workflow. At the heart of this new workflow…news.dartlang.org","markups":[{"type":3,"start":0,"end":186,"href":"http://news.dartlang.org/2016/11/flutter-best-mobile-development.html","title":"http://news.dartlang.org/2016/11/flutter-best-mobile-development.html","rel":"","anchorType":0},{"type":1,"start":0,"end":48},{"type":2,"start":49,"end":169}],"mixtapeMetadata":{"mediaResourceId":"4887cbfa2e0b29c14827afb14e07b4ff","thumbnailImageId":"0*xtTOT-Bewb-GPXGm.","href":"http://news.dartlang.org/2016/11/flutter-best-mobile-development.html"}},{"name":"320d","type":3,"text":"Extension libraries","markups":[]},{"name":"607c","type":1,"text":"The StageXL library provides everything you need to render graphics, play audio, load resource files, do animations and much more. But there are other features you may need for your game or application. Therefore StageXL can be extended with more specialized features which are available in extra packages. The following extensions are available on GitHub as well as on Pub.","markups":[{"type":3,"start":370,"end":373,"href":"https://pub.dartlang.org/","title":"","rel":"","anchorType":0}]},{"name":"2928","type":1,"text":"StageXL_Spine: Spine is dedicated to 2D skeletal animation, providing an efficient workflow both for creating amazing animation and for integrating it into your games. Spine provides numerous tools to shape and refine your 2D animations. Bend and deform images with mesh skinning/weights, adjust timing with the dopesheet, visualize motion with ghosting, pose your characters with inverse kinematics, create pseudo 3D effects, and much more. (demo)","markups":[{"type":3,"start":0,"end":13,"href":"https://github.com/bp74/StageXL_Spine","title":"","rel":"","anchorType":0},{"type":3,"start":15,"end":20,"href":"http://esotericsoftware.com/","title":"","rel":"","anchorType":0},{"type":3,"start":443,"end":447,"href":"http://www.stagexl.org/show/spine/raptor/example.html","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":15}]},{"name":"1316","type":1,"text":"StageXL_DragonBones: DragonBones is an open source 2D skeleton animation solution very popular among Flash and Starling developers. The editor is available for Mac and Windows and does not require Adobe Flash. DragonBones may not be as feature rich as Spine, but provides enough functionality for most use cases. (demo)","markups":[{"type":3,"start":0,"end":19,"href":"https://github.com/bp74/StageXL_DragonBones","title":"","rel":"","anchorType":0},{"type":3,"start":21,"end":32,"href":"http://dragonbones.com/","title":"","rel":"","anchorType":0},{"type":3,"start":314,"end":318,"href":"http://www.stagexl.org/show/dragonbones/dragon_new/example.html","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":21}]},{"name":"075f","type":1,"text":"StageXL_GAF: GAF stands for Generic Animation Format. GAF is designed to store Flash animations in an open cross-platform format for further playback. GAF enables artists and animators to use Adobe Flash for creating complex animations and seamlessly use those animations in StageXL. (demo)","markups":[{"type":3,"start":0,"end":11,"href":"https://github.com/bp74/StageXL_GAF","title":"","rel":"","anchorType":0},{"type":3,"start":13,"end":16,"href":"http://www.gafmedia.com/","title":"","rel":"","anchorType":0},{"type":3,"start":285,"end":289,"href":"http://www.stagexl.org/show/gaf/skeleton/example.html","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":13}]},{"name":"8137","type":1,"text":"StageXL_BitmapFont: Bitmap fonts are created with specialized tools or even designed in PhotoShop to render fancy looking texts. The glyphs are stored on a texture to render texts very efficiently at runtime. The StageXL bitmap font library also supports features like distance fields for sharp edges when scaling or rotating the text. (demo)","markups":[{"type":3,"start":0,"end":18,"href":"https://github.com/bp74/StageXL_BitmapFont","title":"","rel":"","anchorType":0},{"type":3,"start":20,"end":32,"href":"http://kvazars.com/littera/","title":"","rel":"","anchorType":0},{"type":3,"start":269,"end":284,"href":"http://www.stagexl.org/show/bitmapfont/distance_field/example.html","title":"","rel":"","anchorType":0},{"type":3,"start":337,"end":341,"href":"http://www.stagexl.org/show/bitmapfont/texture_atlas/example.html","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":20}]},{"name":"5494","type":4,"text":"Spine animations rendered with StageXL (demo)","markups":[{"type":3,"start":40,"end":44,"href":"http://www.stagexl.org/show/spine/texture-atlas/example.html","title":"","rel":"","anchorType":0}],"layout":1,"metadata":{"id":"1*mImI5oveZ9ohWbaxmFXarg.jpeg","originalWidth":800,"originalHeight":471}},{"name":"462f","type":3,"text":"Links","markups":[{"type":1,"start":0,"end":5}]},{"name":"38d5","type":1,"text":"StageXL:\nStageXL on Github\nStageXL examples on Github\nStageXL API Reference\nStageXL Forum","markups":[{"type":3,"start":9,"end":26,"href":"https://github.com/bp74/StageXL","title":"","rel":"","anchorType":0},{"type":3,"start":27,"end":53,"href":"https://github.com/bp74/StageXL_Samples","title":"","rel":"","anchorType":0},{"type":3,"start":54,"end":75,"href":"http://www.stagexl.org/docs/api/stagexl/stagexl-library.html","title":"","rel":"","anchorType":0},{"type":3,"start":76,"end":89,"href":"https://groups.google.com/forum/#!forum/stagexl","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":8}]},{"name":"ecd6","type":1,"text":"Runtimes:\nStageXL Spine runtime\nStageXL DragonBones runtime\nStageXL GAF runtime\nStageXL Bitmap Fonts","markups":[{"type":3,"start":10,"end":31,"href":"https://github.com/bp74/StageXL_Spine","title":"","rel":"","anchorType":0},{"type":3,"start":32,"end":79,"href":"https://github.com/bp74/StageXL_GAF","title":"","rel":"","anchorType":0},{"type":3,"start":80,"end":100,"href":"https://github.com/bp74/StageXL_BitmapFont","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":9}]},{"name":"a89e","type":1,"text":"Games:\nMemory (source)\nEscape (ported from Flash) (source)\nSupersonic (ported from Flash) (source)","markups":[{"type":3,"start":7,"end":13,"href":"http://www.stagexl.org/example/game/memory","title":"","rel":"","anchorType":0},{"type":3,"start":15,"end":21,"href":"http://www.stagexl.org/example/game/memory/","title":"","rel":"","anchorType":0},{"type":3,"start":23,"end":49,"href":"http://www.stagexl.org/example/game/escape","title":"","rel":"","anchorType":0},{"type":3,"start":51,"end":57,"href":"https://github.com/bp74/StageXL_Samples/tree/master/example/game/escape","title":"","rel":"","anchorType":0},{"type":3,"start":59,"end":89,"href":"http://www.stagexl.org/example/game/supersonic","title":"","rel":"","anchorType":0},{"type":3,"start":91,"end":97,"href":"https://github.com/bp74/StageXL_Samples/tree/master/example/game/supersonic","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":6}]},{"name":"cacd","type":1,"text":"Benchmarks:\nBunny Mark\nStarling","markups":[{"type":3,"start":12,"end":22,"href":"http://www.stagexl.org/example/benchmark/bunny_mark","title":"","rel":"","anchorType":0},{"type":3,"start":23,"end":31,"href":"http://www.stagexl.org/example/benchmark/starling/","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":11}]},{"name":"430e","type":1,"text":"Community projects:\nFlash/ActionScript to StageXL/Dart converter\nRockdot framework (UI and more)","markups":[{"type":3,"start":20,"end":64,"href":"https://github.com/blockforest/stagexl-converter-pubglobal","title":"","rel":"","anchorType":0},{"type":3,"start":65,"end":96,"href":"https://github.com/blockforest/rockdot-framework","title":"","rel":"","anchorType":0},{"type":1,"start":0,"end":19}]}],"sections":[{"name":"bd68","startIndex":0}]},"postDisplay":{"coverless":true}},"virtuals":{"statusForCollection":"APPROVED","allowNotes":true,"previewImage":{"imageId":"1*oPIKFEq7-9ndX53muruOsQ.jpeg","filter":"","backgroundSize":"","originalWidth":800,"originalHeight":400,"strategy":"resample","height":0,"width":0},"wordCount":2007,"imageCount":2,"readingTime":7.956918238993711,"subtitle":"A fast 2D rendering engine for HTML5 and Dart.","userPostRelation":{"userId":"8b6a7f6f197d","postId":"a9c5ff22a534","readAt":0,"readLaterAddedAt":0,"votedAt":0,"collaboratorAddedAt":0,"notesAddedAt":0,"subscribedAt":0,"lastReadSectionName":"","lastReadVersionId":"","lastReadAt":0,"lastReadParagraphName":"","lastReadPercentage":0,"viewedAt":0,"presentedCountInResponseManagement":0,"clapCount":0,"seriesUpdateNotifsOptedInAt":0,"queuedAt":0,"seriesFirstViewedAt":0,"presentedCountInStream":8,"seriesLastViewedAt":0,"audioProgressSec":0},"publishedInCount":1,"usersBySocialRecommends":[],"noIndex":false,"recommends":58,"isBookmarked":false,"tags":[{"slug":"flash","name":"Flash","postCount":1357,"metadata":{"postCount":1357,"coverImage":{"id":"1*RcqAgUFpouyfwoaoksLQOw.jpeg","originalWidth":2048,"originalHeight":1152,"isFeatured":true}},"type":"Tag"},{"slug":"dartlang","name":"Dartlang","postCount":921,"metadata":{"postCount":921,"coverImage":{"id":"1*HNqQFQ2hdhAgjew1pIMqXA.png","originalWidth":2752,"originalHeight":1536,"isFeatured":true}},"type":"Tag"},{"slug":"webgl","name":"Webgl","postCount":1211,"metadata":{"postCount":1211,"coverImage":{"id":"1*gK9rDug43N4J6rnce0qkJg.jpeg","originalWidth":1350,"originalHeight":759,"isFeatured":true}},"type":"Tag"},{"slug":"html5","name":"Html5","postCount":4846,"metadata":{"postCount":4846,"coverImage":{"id":"0*KMP9DJHVlLCZTjRT","originalWidth":6000,"originalHeight":4000,"isFeatured":true,"unsplashPhotoId":"k-rKfqSm4L4"}},"type":"Tag"},{"slug":"javascript","name":"JavaScript","postCount":252158,"metadata":{"postCount":252158,"coverImage":{"id":"1*xqni95gWZ1hGKjt28SbpKA.png","originalWidth":1536,"originalHeight":1024}},"type":"Tag"}],"socialRecommendsCount":0,"responsesCreatedCount":5,"links":{"entries":[],"version":"0.3","generatedAt":1480797589478},"isLockedPreviewOnly":false,"metaDescription":"","totalClapCount":98,"sectionCount":1,"readingList":0,"topics":[]},"coverless":true,"slug":"stagexl-1-0","translationSourcePostId":"","translationSourceCreatorId":"","isApprovedTranslation":false,"inResponseToPostId":"","inResponseToRemovedAt":0,"isTitleSynthesized":true,"allowResponses":true,"importedUrl":"","importedPublishedAt":0,"visibility":0,"uniqueSlug":"stagexl-1-0-a9c5ff22a534","previewContent":{"bodyModel":{"paragraphs":[{"name":"0e3e","type":3,"text":"StageXL 1.0","markups":[],"alignment":1},{"name":"286b","type":13,"text":"A fast 2D rendering engine for HTML5 and Dart.","markups":[],"alignment":1},{"name":"6748","type":4,"text":"","markups":[],"layout":9,"metadata":{"id":"1*oPIKFEq7-9ndX53muruOsQ.jpeg","originalWidth":800,"originalHeight":400}}],"sections":[{"startIndex":0}]},"isFullContent":false,"subtitle":"A fast 2D rendering engine for HTML5 and Dart."},"license":0,"inResponseToMediaResourceId":"","canonicalUrl":"https://blog.dart.dev/stagexl-1-0-a9c5ff22a534","approvedHomeCollectionId":"23738d481ce8","isNewsletter":false,"newsletterId":"","webCanonicalUrl":"https://blog.dart.dev/stagexl-1-0-a9c5ff22a534","mediumUrl":"https://blog.dart.dev/stagexl-1-0-a9c5ff22a534","migrationId":"","notifyFollowers":true,"notifyTwitter":false,"notifyFacebook":false,"responseHiddenOnParentPostAt":0,"isSeries":false,"isSubscriptionLocked":false,"seriesLastAppendedAt":0,"audioVersionDurationSec":0,"sequenceId":"","isEligibleForRevenue":false,"isBlockedFromHightower":false,"deletedAt":0,"lockedPostSource":0,"hightowerMinimumGuaranteeStartsAt":0,"hightowerMinimumGuaranteeEndsAt":0,"featureLockRequestAcceptedAt":0,"mongerRequestType":1,"layerCake":0,"socialTitle":"","socialDek":"","editorialPreviewTitle":"","editorialPreviewDek":"","curationEligibleAt":0,"isProxyPost":false,"proxyPostFaviconUrl":"","proxyPostProviderName":"","proxyPostType":0,"isSuspended":false,"isLimitedState":false,"seoTitle":"","previewContent2":{"bodyModel":{"paragraphs":[{"name":"0e3e","type":3,"text":"StageXL 1.0","markups":[]},{"name":"286b","type":13,"text":"A fast 2D rendering engine for HTML5 and Dart.","markups":[]},{"name":"6748","type":4,"text":"","markups":[],"layout":1,"metadata":{"id":"1*oPIKFEq7-9ndX53muruOsQ.jpeg","originalWidth":800,"originalHeight":400}},{"name":"95ae","type":1,"text":"After more than 4 years in development and available since the early beta versions of Dart, we are proud to announce the release of StageXL 1.0. StageXL is a fast and universal 2D render engine for games and applications on the web. This article talks about the most important features…","markups":[{"type":3,"start":145,"end":152,"href":"http://www.stagexl.org/","title":"","rel":"","anchorType":0}]}],"sections":[{"name":"bd68","startIndex":0}]},"isFullContent":false,"subtitle":"A fast 2D rendering engine for HTML5 and Dart."},"cardType":0,"isDistributionAlertDismissed":false,"isShortform":false,"shortformType":0,"responsesLocked":false,"isLockedResponse":false,"isPublishToEmail":false,"responseDistribution":0,"isMarkedPaywallOnly":false,"type":"Post"},"mentionedUsers":[],"collaborators":[],"hideMeter":false,"shareKey":"f3278a903fa4b1cf120d18d529616713","collectionUserRelations":[{"collectionId":"23738d481ce8","userId":"8b6a7f6f197d","role":"ADMIN"},{"collectionId":"4da7dfd21a33","userId":"8b6a7f6f197d","role":"WRITER"},{"collectionId":"24d8f4fa8912","userId":"8b6a7f6f197d","role":"WRITER"}],"mode":"canEdit","references":{"User":{"be6cdabfe936":{"userId":"be6cdabfe936","name":"Bernhard Pichler","username":"bp74","createdAt":1480750263437,"imageId":"1*RQQiVTVb52vVLSqgNAApnA.jpeg","backgroundImageId":"","bio":"Writing code is fun","twitterScreenName":"","socialStats":{"userId":"be6cdabfe936","usersFollowedCount":1,"usersFollowedByCount":46,"type":"SocialStats"},"social":{"userId":"8b6a7f6f197d","targetUserId":"be6cdabfe936","type":"Social"},"allowNotes":1,"mediumMemberAt":0,"isWriterProgramEnrolled":true,"isSuspended":false,"isMembershipTrialEligible":true,"facebookDisplayName":"","optInToIceland":true,"hasCompletedProfile":false,"hasSeenIcelandOnboarding":false,"postSubscribeMembershipUpsellShownAt":0,"languageCode":"de-at","type":"User"}},"Collection":{"23738d481ce8":{"id":"23738d481ce8","name":"Dart","slug":"dartlang","tags":["MOBILE APP DEVELOPMENT","WEB DEVELOPMENT","DART","PROGRAMMING LANGUAGES","SOFTWARE DEVELOPMENT"],"creatorId":"a6d788faa5e5","description":"Dart is an approachable, portable, and productive language for high-quality apps on any platform. Learn more at https://dart.dev.","shortDescription":"Dart is an approachable, portable, and productive language…","image":{"imageId":"1*uWy1Ajpd0oTUQBO9WBHoQg@2x.png","filter":"","backgroundSize":"","originalWidth":1001,"originalHeight":1001,"strategy":"resample","height":0,"width":0},"metadata":{"followerCount":14031,"activeAt":1762974121956},"virtuals":{"permissions":{"canPublish":true,"canPublishAll":true,"canRepublish":true,"canRemove":true,"canManageAll":true,"canSubmit":true,"canEditPosts":true,"canAddWriters":true,"canViewStats":true,"canSendNewsletter":true,"canViewLockedPosts":true,"canViewCloaked":true,"canEditOwnPosts":true,"canBeAssignedAuthor":true,"canEnrollInHightower":false,"canLockPostsForMediumMembers":false,"canLockOwnPostsForMediumMembers":false,"canViewNewsletterV2Stats":true,"canCreateNewsletterV3":true},"isSubscribed":true,"isEnrolledInHightower":false,"isEligibleForHightower":false,"isSubscribedToCollectionEmails":false,"isMuted":false,"canToggleEmail":false,"isWriter":false},"logo":{"imageId":"1*NRb7RFVWJQFzY47j3v4U7Q.png","filter":"","backgroundSize":"","originalWidth":400,"originalHeight":154,"strategy":"resample","height":0,"width":0},"twitterUsername":"dart_lang","publicEmail":"medium@dartlang.org","domain":"blog.dart.dev","sections":[{"type":2,"collectionHeaderMetadata":{"title":"Dart","description":"An approachable, portable, and productive language for high-quality apps on any platform","backgroundImage":{},"logoImage":{"id":"1*knHF_qpxdtS8h0Z8EeqowA@2x.png","originalWidth":1080,"originalHeight":1080,"alt":"Dart"},"alignment":2,"layout":5}},{"type":1,"postListMetadata":{"source":1,"layout":4,"number":7,"postIds":[]}},{"type":1,"postListMetadata":{"source":1,"layout":5,"number":15,"postIds":[]}}],"tintColor":"#FF042B59","lightText":true,"favicon":{"imageId":"","filter":"","backgroundSize":"","originalWidth":0,"originalHeight":0,"strategy":"resample","height":0,"width":0},"colorPalette":{"defaultBackgroundSpectrum":{"colorPoints":[{"color":"#FF6588BA","point":0},{"color":"#FF607EAB","point":0.1},{"color":"#FF59759C","point":0.2},{"color":"#FF536B8E","point":0.3},{"color":"#FF4C617F","point":0.4},{"color":"#FF445670","point":0.5},{"color":"#FF3D4B61","point":0.6},{"color":"#FF344052","point":0.7},{"color":"#FF2B3442","point":0.8},{"color":"#FF212832","point":0.9},{"color":"#FF161A22","point":1}],"backgroundColor":"#FFFFFFFF"},"tintBackgroundSpectrum":{"colorPoints":[{"color":"#FF042B59","point":0},{"color":"#FF294871","point":0.1},{"color":"#FF456087","point":0.2},{"color":"#FF5F779B","point":0.3},{"color":"#FF788DAD","point":0.4},{"color":"#FF8FA2BF","point":0.5},{"color":"#FFA5B6CF","point":0.6},{"color":"#FFBBC9DF","point":0.7},{"color":"#FFD1DCEE","point":0.8},{"color":"#FFE6EEFC","point":0.9},{"color":"#FFFBFFFF","point":1}],"backgroundColor":"#FF042B59"},"highlightSpectrum":{"colorPoints":[{"color":"#FFECF3FF","point":0},{"color":"#FFE9F2FF","point":0.1},{"color":"#FFE5F0FF","point":0.2},{"color":"#FFE2EFFF","point":0.3},{"color":"#FFDEEDFF","point":0.4},{"color":"#FFDBEBFF","point":0.5},{"color":"#FFD7EAFF","point":0.6},{"color":"#FFD3E8FF","point":0.7},{"color":"#FFCFE6FF","point":0.8},{"color":"#FFCBE5FF","point":0.9},{"color":"#FFC8E3FF","point":1}],"backgroundColor":"#FFFFFFFF"},"darkBackgroundSpectrum":{"colorPoints":[{"color":"#FF7DA0D3","point":0},{"color":"#FF89A9D8","point":0.1},{"color":"#FF94B1DC","point":0.2},{"color":"#FFA0B9E0","point":0.3},{"color":"#FFABC1E3","point":0.4},{"color":"#FFB6C9E7","point":0.5},{"color":"#FFC0D1EB","point":0.6},{"color":"#FFCBD8EF","point":0.7},{"color":"#FFD5E0F2","point":0.8},{"color":"#FFE0E7F6","point":0.9},{"color":"#FFEAEFFA","point":1}],"backgroundColor":"#FF000000"}},"navItems":[{"type":1,"title":"Announcements","tagSlug":"announcements","url":"https://blog.dart.dev/tagged/announcements","source":"tagSlug"},{"type":5,"title":"Archive","url":"https://blog.dart.dev/archive"},{"type":3,"title":"dart.dev","url":"https://dart.dev"}],"colorBehavior":2,"collectionFeatures":[25],"ampLogo":{"imageId":"","filter":"","backgroundSize":"","originalWidth":0,"originalHeight":0,"strategy":"resample","height":0,"width":0},"header":{"title":"Dart","description":"An approachable, portable, and productive language for high-quality apps on any platform","backgroundImage":{},"logoImage":{"id":"1*knHF_qpxdtS8h0Z8EeqowA@2x.png","originalWidth":1080,"originalHeight":1080,"alt":"Dart"},"alignment":2,"layout":5},"subscriberCount":14031,"tagline":"Dart is a client-optimized language for fast apps on any platform.","isOptedIntoAurora":false,"isCurationAllowedByDefault":false,"polarisCoverImage":{"imageId":"","filter":"","backgroundSize":"","originalWidth":0,"originalHeight":0,"strategy":"resample","height":0,"width":0},"ptsQualifiedAt":1616092887098,"type":"Collection"}},"Social":{"be6cdabfe936":{"userId":"8b6a7f6f197d","targetUserId":"be6cdabfe936","type":"Social"}},"SocialStats":{"be6cdabfe936":{"userId":"be6cdabfe936","usersFollowedCount":1,"usersFollowedByCount":46,"type":"SocialStats"}}}},"v":3,"b":"20260130-1012-root"}